class AuthLocators:
    # локатор логотипа "Лабиринт"
    AUTH_LOGO = (By.CLASS_NAME, "b-header-b-logo-e-logo")

    # Локатор кнопки "Телефон" на стартовой на странице
    AUTH_START_
    # Локатор кнопки "Почта" на стартовой на странице
    AUTH_START_
    # Локатор кнопки "Логин" на стартовой на странице
    AUTH_START_
    # Локатор кнопки "Лицевой счет" на стартовой на странице
    AUTH_START_
    # Локатор кнопки "Забыл пароль" на стартовой на странице
    AUTH_START_
    # Локатор кнопки "Войти" на стартовой на странице
    AUTH_START_
    # Локатор кнопки "Пользовательское соглашение" на стартовой на странице
    AUTH_START_
    # Локатор кнопки социальных сетей "ВК" на стартовой на странице
    AUTH_START_
     # Локатор кнопки социальных сетей "Однокласники" на стартовой на странице
    AUTH_START_
     # Локатор кнопки социальных сетей "Мой мир" на стартовой на странице
    AUTH_START_
     # Локатор кнопки социальных сетей "Google" на стартовой на странице
    AUTH_START_
     # Локатор кнопки социальных сетей "Яндекс" на стартовой на странице
    AUTH_START_
    # Локатор кнопки "Регистрация" на стартовой на странице
    AUTH_START_
    # Локатор кнопки "Чат" на стартовой на странице
    AUTH_START_
  
  (By.XPATH, '//div[@class="pagination-next"]/a[text()="Следующая"]')
  
  (By.CLASS_NAME, "b-header-b-personal-e-list-item")
    
   (By.XPATH, '//div[@class="pagination-next"]/a[text()="Следующая"]')
  
  
  
  
  
  
 
